{
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "hidden_dim": 3072,
  "id2label": {
    "0": "filter products",
    "1": "show all products",
    "2": "goodbye",
    "3": "help",
    "4": "greeting"
  },
  "initializer_range": 0.02,
  "label2id": {
    "filter products": 0,
    "goodbye": 2,
    "greeting": 4,
    "help": 3,
    "show all products": 1
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "torch_dtype": "float32",
  "transformers_version": "4.53.0",
  "vocab_size": 30522
}
